MONSTER_TABLE = [
  ['スライム', 1..3],
  ['コウモリ', 1..6],
  ['オオウミウシ', 1..6],
  ['ツバメ', 1..6],
  ['ワラビー', 2..6],
  ['催眠術師', 2..9],
  ['ピューシャン', 4..9],
  ['ファンガス', 4..12],
  ['グール', 4..12],
  ['木乃伊', 5..12],
  ['ノーム', 7..15],
  ['ハゲタカ', 7..18],
  ['ソーサラー', 7..18],
  ['メタルヨテイチ',10..99],
  ['おめん武者',10..18],
  ['アクアター',10..20],
  ['どろぼう猫',10..18],
  ['ガーゴイル',13..21],
  ['四人トリオ',13..21],
  ['白い手',[16..26,32..99]],
  ['ゴーレム',16..24],
  ['ボンプキン',13..27],
  ['パペット',16..25],
  ['ゆうれい',19..27],
  ['ミミック',19..27],
  ['トロール',20..27],
  ['目玉',32..99],
  ['化け狸',22..27],
  ['土偶',32..27],
  ['デビルモンキー',23..99],
  ['マルスボース',24..99],
  ['竜',25..99],
]

require 'pp'

pp MONSTER_TABLE

table = (1..99).map { |f| [f] }
p table

MONSTER_TABLE.each do |name, ranges|
  if ranges.is_a? Range
    ranges = [ranges]
  end

  ranges.each do |r|
    r.each do |f|
      row = table.assoc(f)
      row.push([name, 10])
    end
  end
end

pp table